#game "blackgate"
var Func0866 0x866 ()
{
	var var0000;
	var var0001;
	var var0002;
	var var0003;

	var0000 = ("打击笼" & ("*" & ("旗杆" & ("*" & ("数字" & ("*" & ("钉子" & ("*" & ("epaphite" & ("*" & ("阿谀奉承者" & ("*" & ("煽动者" & "*")))))))))))));
	var0000 = (var0000 & ("先知" & ("*" & ("利润" & ("*" & ("脓" & ("脓" & ("覆盖物" & ("覆盖物" & ("花园地精" & "*"))))))))));
	var0000 = (var0000 & ("个人危机" & ("个人危机" & ("机智" & ("*" & ("深海潜水球" & ("*" & ("果冻香料" & ("*" & ("折纸球" & ("*" & ("圣餐饼" & ("*" & ("世界末日" & ("*" & ("气球付款" & "*"))))))))))))))));
	var0001 = UI_die_roll(0x0001, (UI_get_array_size(var0000) / 0x0002));
	var0002 = var0000[((var0001 * 0x0002) - 0x0001)];
	var0003 = var0000[(var0001 * 0x0002)];
	if (!(var0003 == "*")) goto labelFunc0866_00F5;
	var0003 = var0002;
labelFunc0866_00F5:
	return [var0002, var0003];
	return 0;
}


