#game "blackgate"
var Func0867 0x867 ()
{
	var var0000;
	var var0001;
	var var0002;
	var var0003;

	var0000 = ("便秘的" & ("碎形的" & ("功能失调的" & ("阅读障碍的" & ("利尿的" & ("腺体的" & ("荷尔蒙的" & ("迟钝的" & ("肥胖的" & ("党派的" & "双边的"))))))))));
	var0000 = (var0000 & ("对称的" & ("正面的" & ("多余的" & ("过饱和的" & ("臼齿的" & ("低压的" & ("诊断的" & ("酸性的" & ("经验的" & ("基本的" & ("自杀倾向的" & ("安慰的" & "被动的")))))))))))));
	var0000 = (var0000 & ("享乐主义的" & ("异教的" & ("慈善的" & ("歌剧的" & ("分阶段的" & ("受影响的" & ("怪诞的" & ("高潮的" & ("有机的" & ("迂腐的" & ("帝国主义的" & ("脾气暴躁的" & "相互依赖的")))))))))))));
	var0001 = UI_die_roll(0x0001, UI_get_array_size(var0000));
	var0002 = var0000[var0001];
	var0001 = UI_die_roll(0x0001, UI_get_array_size(var0000));
	var0003 = var0000[var0001];
	return [var0002, var0003];
	return 0;
}


