#game "blackgate"
var Func0869 0x869 ()
{
	var var0000;
	var var0001;
	var var0002;
	var var0003;
	var var0004;

	var0000 = ["核对", "核对了", "正在核对", "烤焦", "*", "*", "呱呱叫", "*", "*", "小睡", "小睡了", "正在小睡", "创建人脉", "*", "*", "变魔术", "变魔术了", "正在变魔术"];
	var0000 = var0000 & ["发起运动", "*", "*", "抗议", "*", "*", "喷出", "*", "*", "居住", "*", "*", "审查", "*", "*"];
	var0000 = var0000 & ["解雇", "解雇了", "正在解雇", "照射", "照射了", "正在照射", "干洗", "干洗了", "正在干洗"];
	var0001 = UI_die_roll(0x0001, (UI_get_array_size(var0000) / 0x0003));
	var0002 = var0000[((var0001 * 0x0003) - 0x0002)];
	var0003 = var0000[((var0001 * 0x0003) - 0x0001)];
	var0004 = var0000[(var0001 * 0x0003)];
	if (!(var0003 == "*")) goto labelFunc0869_010E;
	var0003 = (var0002 + "了");
labelFunc0869_010E:
	if (!(var0004 == "*")) goto labelFunc0869_0122;
	var0004 = ("正在" + var0002);
labelFunc0869_0122:
	return [var0002, var0003, var0004];
	return 0;
}


