#game "blackgate"
var Func086C 0x86C ()
{
	var var0000;
	var var0001;
	var var0002;
	var var0003;

	var0000 = ("犰狳" & ("*" & ("章鱼" & ("章鱼" & ("有蹄类" & ("*" & ("凤头鹦鹉" & ("*" & ("雪貂" & ("*" & ("黄鼠狼" & ("*" & ("鲈鱼羚羊" & "*")))))))))))));
	var0000 = (var0000 & ("鸭嘴兽" & ("鸭嘴兽" & ("小黑蚊" & ("*" & ("羊驼" & ("*" & ("月亮牛" & ("*" & ("雷霆驼鹿" & ("*" & ("大羊驼" & "*"))))))))))));
	var0000 = (var0000 & ("鬣蜥" & ("*" & ("爬虫类" & ("*" & ("两栖动物" & ("*" & ("哺乳动物" & ("*" & ("无脊椎动物" & "*"))))))))));
	var0001 = UI_die_roll(0x0001, (UI_get_array_size(var0000) / 0x0002));
	var0002 = var0000[((var0001 * 0x0002) - 0x0001)];
	var0003 = var0000[(var0001 * 0x0002)];
	if (!(var0003 == "*")) goto labelFunc086C_00E5;
	var0003 = var0002;
labelFunc086C_00E5:
	return [var0002, var0003];
	return 0;
}


