#game "blackgate"
var Func086D 0x86D ()
{
	var var0000;
	var var0001;
	var var0002;
	var var0003;

	var0000 = ("双子叶植物" & ("*" & ("针叶树" & ("*" & ("蛞蝓" & ("*" & ("树懒" & ("*" & ("鼹鼠人" & ("鼹鼠人" & ("豆荚人" & ("豆荚人" & ("加拿大人" & ("*" & ("多米尼加人" & ("*" & ("巴斯克人" & "*")))))))))))))))));
	var0000 = (var0000 & ("吉普赛人" & ("吉普赛人" & ("塞尔维亚人" & ("*" & ("克罗地亚人" & ("*" & ("蒙古人" & ("*" & ("斯拉夫人" & ("*" & ("印度教徒" & ("*" & ("基督徒" & ("*" & ("基督教科学派" & ("*" & ("头足类" & ("*" & ("摇滚乐评" & "*"))))))))))))))))))));
	var0001 = UI_die_roll(0x0001, (UI_get_array_size(var0000) / 0x0002));
	var0002 = var0000[((var0001 * 0x0002) - 0x0001)];
	var0003 = var0000[(var0001 * 0x0002)];
	if (!(var0003 == "*")) goto labelFunc086D_00E7;
	var0003 = var0002;
labelFunc086D_00E7:
	return [var0002, var0003];
	return 0;
}


