#game "blackgate"
void Func0877 0x877 ()
{
	message("「我将告诉你有关 Cove 唯一不快乐的人的故事——Nastassia。她是镇上唯一没有爱人的人。这并不是说她没有追求者——她可是非常美丽的！她满脑子想的都是慈悲神殿，你现在可能在那里能找到她。」~~De Maria 弹拨着他的鲁特琴并唱道：~~");
	say();
	message("「曾经有位名叫 Ariana 的少女～她对神殿如此珍视。～她要求她的后代也要这样做～并年复一年地保持下去。");
	say();
	message("「她的儿子 Mikhail 成为了镇长～他的目标是维持～这座城镇古老而受人喜爱的声誉～作为爱与激情之城！");
	say();
	message("「Mikhail 最年长的孩子是 Magda；～她建造了『爱人小径』，一座美丽的公园，～在那里，Cove 所有的爱人们，无论老少，～都能在黑暗的户外谈情说爱！");
	say();
	message("「啊，但不幸的阴云却隐藏在～阳光看似最明媚的地方。～而可怜的 Nadia，Magda 的女儿，～她所承受的不幸却比任何人都多！");
	say();
	message("「故事始于有一天 Nadia 嫁给了～Julius，一个不怎么富有的年轻小伙子。～他留下怀着身孕的她，远走他乡。～至于 Nadia 可怜的心，那是多么悲伤。");
	say();
	message("「有一天从 Yew 传来了宿命般的消息～Julius 被野兽杀死了；～孩子早产了，这是一次艰难的生产；～而 Nadia 的灵魂变得冰冷。");
	say();
	message("「手拿匕首，怀抱婴儿～Nadia 跑向了神殿。～她将匕首刺入了自己的胸膛；～她再也无法看见太阳。");
	say();
	message("「你看，Nastassia 从小就是个孤儿，～没有人爱，也没有人要；～如今她独自一人披着孤独的外衣行走着～等待着命运的呼唤。");
	say();
	message("「这就是可怜的 Nastassia 的故事。也许你能让她振作起来。去找她吧，我恳求你！」*");
	say();
	gflags[0x00E0] = true;
	return;
}


