#game "blackgate"
var Func0868 0x868 ()
{
	var var0000;
	var var0001;
	var var0002;
	var var0003;
	var var0004;

	var0000 = ["泌乳", "泌乳了", "正在泌乳", "卑躬屈膝", "卑躬屈膝了", "正在卑躬屈膝", "釀造", "*", "*", "消化", "*", "*", "抱怨", "*", "*"];
	var0000 = var0000 & ["gump", "*", "*", "狂笑", "*", "*", "遊蕩", "*", "*", "招攬", "*", "*"];
	var0000 = var0000 & ["代表", "*", "*", "結合", "*", "*", "下沉", "下沉了", "*", "收穫", "*", "*", "八卦", "*", "*", "偽造", "偽造了", "*", "控告", "控告了", "正在控告"];
	var0000 = var0000 & ["旋轉", "旋轉了", "正在旋轉", "伸展", "*", "*", "採花", "*", "*"];
	var0001 = UI_die_roll(0x0001, (UI_get_array_size(var0000) / 0x0003));
	var0002 = var0000[((var0001 * 0x0003) - 0x0002)];
	var0003 = var0000[((var0001 * 0x0003) - 0x0001)];
	var0004 = var0000[(var0001 * 0x0003)];
	if (!(var0003 == "*")) goto labelFunc0868_0150;
	var0003 = (var0002 + "了");
labelFunc0868_0150:
	if (!(var0004 == "*")) goto labelFunc0868_0164;
	var0004 = ("正在" + var0002);
labelFunc0868_0164:
	return [var0002, var0003, var0004];
	return 0;
}


